# IdeaStatiCa.ConnectionApi.Model.ConLocalCoordinateSystem

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Origin** | **Point3D** |  | [optional]
**XAxis** | **Vector3D** |  | [optional]
**YAxis** | **Vector3D** |  | [optional]
**ZAxis** | **Vector3D** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)